tutorial/Turek-Hron-FSI/fluid-openfoam/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      preciceDict;
}

preciceConfig "../precice-config.xml";

participant Fluid;

modules (FSI);

interfaces
{
  Interface1
  {
    mesh              Fluid-Mesh-Centers;
    patches           (flap);
    locations         faceCenters;
    
    readData
    (
    );
    
    writeData
    (
      Force
    );
  };
  
  Interface2
  {
    mesh              Fluid-Mesh-Nodes;
    patches           (flap);
    locations         faceNodes;
    
    readData
    (
      Displacement
    );
    
    writeData
    (
    );
  };
};

FSI 
{
  rho   rho [ 1 -3  0 0 0 0 0 ] 1000.0;
}
